{
  "title": "OpenSupaplex",
  "author": "sergiou87",
  "category": "game",
  "version": "7.1",
  "url": "https://github.com/sergiou87/open-supaplex/",
  "license": "GPLv3",
  "description": "Classic scrolling tile-based puzzle game",
  "details": "OpenSupaplex is an open-source reimplementation of Supaplex by sergiou87. Supaplex is a video game created by Philip Jespersen and Michael Stopp, two Swiss students, and published by Digital Integration in 1991. It is an extended clone of Boulder Dash.\nSupaplex introduces a number of new elements that were not present in Boulder Dash, including bugs, pieces of base that randomly cause a life-threatening electrostatic discharges, Ports, which limit Murphy's movement to specific directions, and terminals, which set off yellow Utility Disks. Utility Disks are explosive floppy disks and come in three different colors: Orange Disks work like Zonks, but explode when hit or when falling. Yellow Disks do not fall yet may be pushed in any direction, but not pulled (which allows creating Sokoban-like puzzles), and explode when the Terminal is used. Red Disks can be carried and dropped when convenient, exploding seconds after.\nSupaplex is the first Boulder Dash-like game that is not fully grid-based: while the playing field is an obvious grid, the objects do not 'snap' from one grid position to another, but can be halfway or 'in between' grid positions while moving or falling. This behavior has led to a number of well-known bugs that can be turned to the player's advantage, many of which need to be exploited to complete fan-made levels. For instance, by turning around quickly, the player can cause an enemy or rock to 'bounce' off Murphy.\nThe game also applies 'gravity' on some levels, which means that Murphy will fall down empty spaces and will be unable to go back up, unless he climbs up by using bases. Gravity is not actually designated - the player can only notice via trial-and-error.\nControls:\n- Up/Down/Left/Right: left joystick or directional pad\n- Removing bases/infotrons next to Murphy: Y button + direction\n- Detonate red disk: hold Y button\n- Show/hide bottom game panel: X button\n- Show number of red disks: A button\n- Change game speed: L and R buttons\n- Exit/back: - button\n- Pause: + button\n",
  "changelog": "NEW:\n- Added support for PSP, Nintendo 3DS, Windows 64bit, macOS, PS3, Wii and Wii U.\n- Added Music and Sound Effects.\n- Added support for saving and loading game states.\n- Bumped the default game speed from 5 to 10 (maximum). \n- Added different scaling modes.\n- Improved gamepad controls:\n    - LB/L1/L and RB/R1/R buttons can be used in the main menu to select a different level set.\n    - LB/L1/L and RB/R1/R buttons can be used in during the game to change the game speed.\n    - Y/Triangle button (X on Nintendo consoles) shows/hides the bottom panel during the game.\n    - B/Circle button (A on Nintendo consoles) displays, for a few seconds, the number of red disks you have.\n    - Back/Select/Minus during a game will exit the level immediately.\n    - Start/Plus during a game will pause the game.\n- Added advanced menu giving access to many options that were only available with a keyboard before, or not available at all:\n    - Restart the level.\n    - Sound and music volume.\n    - Change the scaling mode.\n    - Game speed.\n    - Play/record demos.\n    - Debug options (show FPS, load/save state, remove Zonks/Snik Snaks…). If you use these, your progress won't count!!\n    - And more things!\n- Added command line options in platforms that support this. Just run the game with `--help` for more info.\n\nFIXED:\n- Fixed many MANY bugs. Now the game should behave exactly as the original, validated by almost 7000 pre-recorded demos.\n"
}
